<?php
    // =======================================================================
    /**
    *  @package     Impera CMS
    *  @file        Robokassa payment module
    *  @version     1.0
    *  @author      AIMatrix, Ukraine
    *  @copyright   Copyright 2013, AIMatrix
    *  @link        http://imperacms.ru/
    */
    // =======================================================================

    // подключаем подложку платежного модуля (легальный запуск)
    $legalStart = TRUE;
    require_once(dirname(__FILE__) . '/Substrate.php');



    // =======================================================================
    /**
    *  Модуль оплаты через платежную систему Robokassa
    */
    // =======================================================================

    class Robokassa extends PaymentModuleSubstrate {

        // меточное имя модуля
        protected $marker = 'Robokassa';



        // ===================================================================
        /**
        *  Обработка входных параметров
        *
        *  @access  public
        *  @return  string      результат
        */
        // ===================================================================

        public function process () {

            // начинаем оплату
            $status =  $this->startPayment('InvId',               'Ошибка: Не указан идентификатор оплачиваемого заказа!',
                                                                  'Ошибка: Оплачиваемый заказ не найден!',
                                                                  'Спасибо! Ваш заказ оплачен.',

                                           // ИД способа оплаты
                                           'Shp_item',            'Ошибка: Не указан идентификатор способа оплаты!',
                                                                  'Ошибка: Неизвестный способ оплаты или он отключен!',
                                                                  'Ошибка: У способа оплаты отсутствуют или не те параметры!',

                                           // контрольная подпись
                                           'SignatureValue',      'Ошибка: Недостаточно входных параметров!',

                                           // сумма оплаты
                                           'OutSum',              'Ошибка: Недостаточно входных параметров!',
                                                                  'Ошибка: Неверная сумма оплаты!',

                                           // секретный ключ (из параметров способа оплаты)
                                           'robokassa_password2', 'Ошибка: У способа оплаты нарушена структура параметров!');
            if (is_string($status)) return $status;

            // проверяем контрольную подпись
            $sign = $this->sum . ':'
                  . $this->id . ':'
                  . $this->secret . ':'
                  . 'Shp_item=' . $this->pay_id;
            $sign = strtoupper(md5($sign));
            if ($sign != $this->sign) {
                $sign = $this->sum . ':'
                      . $this->id . ':'
                      . $this->secret;
                $sign = strtoupper(md5($sign));
                if ($sign != $this->sign) return 'Ошибка: Контрольная подпись неправильная!';
            }

            // проверяем наличие товаров
            $status = $this->checkOrderProducts($this->order);
            if (is_string($status)) return $status;

            // завершаем оплату
            $this->finalizePayment($this->order, $this->pay_id, $this->marker);

            return 'OK' . $this->id . "\n";
        }
    }



    // =======================================================================
    /**
    *  Внеклассовая часть программного кода
    */
    // =======================================================================

    $module = new Robokassa();
    echo $module->process();
    exit;
?>