<?php
    // =======================================================================
    /**
    *  Дефолтный переводчик (локализатор) интерфейса
    *
    *  @package     Impera CMS
    *  @author      AIMatrix
    *  @copyright   Copyright 2012, AIMatrix
    *  @link        http://imperacms.ru
    */
    // =======================================================================

    class LangANYModel {



        // ===================================================================
        /**
        *  Запуск
        *
        *  @access  public
        *  @return  void
        */
        // ===================================================================

        public function start () {

            // безопасность
            $this->cms = null;
            $this->owner = null;
        }



        // ===================================================================
        /**
        *  Перевод произвольного текста
        *
        *  @access  public
        *  @param   string  $text   исходный текст
        *  @return  string          переведенный текст
        */
        // ===================================================================

        public function translate ( $text ) {
            return $text;
        }



        // ===================================================================
        /**
        *  Перехватчик отсутствующих ключей
        *
        *  @access  public
        *  @param   string  $name   имя ключа
        *  @return  string          имя ключа (чтобы в шаблоне видеть, для чего отсутствует перевод)
        */
        // ===================================================================

        public function __get ( $name ) {
            return $name;
        }
    }



    return;
?>